const { SlashCommandBuilder } = require('@discordjs/builders');
const { EmbedBuilder } = require('discord.js');

module.exports = {
    data: new SlashCommandBuilder()
        .setName('كت')
        .setDescription('كت تويت على السريع'),

    async execute(interaction, client) {

      const cut = [
        'كيف تفرغ غضبك بالعادة ؟',
        'يقولون أن مواليد شهر ابريل أجمل ناس، تتفقون ؟',
        'صراحة | كم مرة أحببت بصدق للآن ؟',
        'ردك لو احد غلط بحقك واعتذر لك ؟',
        'مين جالس عندك ؟',
        'مع او ضد: اكثر من يحلون مشاكل الناس ، هم اكثر الناس لديهم مشاكل ...',
        'اطول مدة قضيتها بدون اكل ؟',
        'شخص يشفي لك جروحك ؟',
        'يوم نفسك يرجع بكل تفاصيله ؟',
        'عندك شخص مستحيل يمر يوم وما تكلمه ؟',
        'كلمة أو جملة تضعف حاسة السمع لديك؟🏃🏻',
        'وش اول جوال شريته ؟',
        'شيء حلو صار لك اليوم ؟',
        'شخص غير فيك شيء ؟',
        'تحب تتعلم ولا لأ ؟',
        'امنية هالوقت ؟',
        'جمله او مقوله تؤمن بها ؟',
        'تعطي الناس فرصة تتقرب منك ؟',
        'كيف كان يومك ؟',
        'ردك المُعتاد إذا أحد ناداك ؟',
        'اول بيت تزوره فالعيد',
        'اسف تقولها لمين ؟',
        'أصعب انتظار ؟',
        'كيف تجعل أسلوبك جذابًا أمام الآخرين؟',
        'وش اسم اول شخص تعرفت عليه في الديسكورد ؟',
        'اكثر وقت تحب النوم فيه',
        'رتبهم: (الحب - الصحة - الكرامة - المال)',
        'اخر مره سافرت بالطائرة والى وين ؟',
        'شخص ما يرد لك طلب ؟',
        'شكراً لأنك في حياتي .. تقولها لمين ؟',
        'تفضل : الصباح ، الليل',
        'كمل : حلو يومك بـ وجود ...',
        'برأيك ما هي أسوأ ظاهرة منتشرة في مواقع التواصل الاجتماعي؟',
        'شي مشتهر فيه عند عائلتك ؟',
        'تشوف انك قادر على تحمل المسؤولية ؟',
        '"المنطقي عديم إحساس" مع أو ضد والسبب؟',
        'اذا انسجنت وش تتوقع بتكون التهمة الي عليك ؟',
        'اكمل | انا من الاشخاص الي ...',
        'كلمة للشهر الأخير من السنة الحالية ؟',
        'هل يؤنبك ضميرك تجاه أحد ما؟',
        'اخر مره بكيت متى ؟',
        'تاريخ ميلادك + هدية بخاطرك تجيك',
        'أقبح شعور ؟',
      ]
      const random = cut[Math.floor(Math.random() * cut.length)]
        let embed = new EmbedBuilder()
            .setAuthor({name : `${interaction.user.username}`, iconURL : `${interaction.user.displayAvatarURL({ dynamic : true })}`})
            .setThumbnail(`${interaction.guild.iconURL({ dynamic : true })}`)
             .setColor("Random")
            .setTitle(`${random}`)
            .setFooter({ text : `${client.user.username}`, iconURL : `${client.user.displayAvatarURL()}`})
        await interaction.reply({ embeds: [embed] });
    }
}