const { SlashCommandBuilder } = require('@discordjs/builders');
const { EmbedBuilder } = require('discord.js');

module.exports = {
    data: new SlashCommandBuilder()
        .setName('عقاب')
        .setDescription('تحدي اصحابك و عاقبهم'),

    async execute(interaction, client) {

      const eiqab = [
               'ارسل أكثر صورة مو حلوه عندك 📸',
        'خلي الي قبلك يختار لك افاتار بكيفه',
        'غير صورة بروفايلك لآخر صورة محفوظة عندك',
        'منشن اكثر شخص حاقد عليه',
        'روح لأحد ما تعرفه وقول له ما عندي فلوس',
        'ارسل اكثر صورة ابدعت في تصويرها',
        'اول @منشن يجي عندك قوله انت عمي',
        'روح الى اي قروب عندك في الواتس اب واكتب اي شيء يطلبه منك اللاعبين ، الحد الأقصى 3 رسائل',
        'صور اي شيء يطلبه منك اللاعبين',
        'قول كلمة طويلة من اختيار احد بالروم وبدل حرف الـ خ بحرف ث',
        'روح عند أحد ما تعرفه وقول له ابي بوسه',
        'اكتب في الحاله -بتحبيني يا هدى ؟',
        'استخدم كلمات اغنية فقط للتحدث لمدة دقيقة',
        'قول نكتة واذا ما ضحك أحد يعطونك ميوت لين يجي دورك مره ثانيه',
        'لا تتكلم ولا كلمة الين يجي دورك مرة ثانية واذا تكلمت يجيك باند لمدة يوم كامل من السيرفر',
        'غني باللهجه العراقيه',
        'تحدث إلى شخص غريب واقنعه أنك تعرفه وسوي خوي معاه',
        'غير افاتارك لصورة كلب لين تنتهي اللعبه',
        'عقابك انك تعترف بأي شيء يطلبه منك الفائز',
        'قول بطتكم بطت بطن بطتـنا و بطتـنا تقـدر تبط بطن بطتكم، 3 مرات واذا غلطت الي بعدك يعطيك عقاب من ذوقه',
        'قول قصيدة بالهندي @*^%#(!',
        'مسامحك من العقاب ، أحبك',
        'جاوب على اي سؤال يسأله',
        'تحدث إلى شخص ما بلهجة غير موجوده',
        'تاخذ عقابين',
        'منشن خويك وقوله مين انت ؟',
        'قلد صوت حيوان يطلبوه منك',
        'كم رصيدك بالبنك ؟',
        'اكتب في الحاله انا غبي والمدة يحددها الي بعدك',
        'تكلم باللهجه المصرية الى ان يجي دورك مره ثانيه',
        'تكلم باللغة الانجليزية الى ان يجي دورك مرة ثانية',
        'روح المطبخ واكسر صحن او كوب وأرسل صورة في الشات',
        'قول لاي بنت موجوده بالروم كلمة حلوه',
        'غني اي اغنية وانت عاض لسانك',
        'روح أي سيرفر غريب وسوي سبام وازعجهم هناك',
        'روح لشخص معطيه بلوك وسلم عليه',
        'اقرا اسماء الي موجودين بالروم وانت مسكر خشمك',
        'اكتب في البروفايل احبك يا وهاب',
        'ارسل اخر صورة صورتها بجوالك',
        'اعطي اي احد جنبك كف اذا مافيه احد جنبك اعطي نفسك ونبي نسمع صوت الكف',
        'افتح شير سكرين على اخر محادثة دارت بخاصك',
        'ارمي جوالك على الأرض بقوة واذا انكسر صور و ارسل في الشات العام',
        'منشن اونر السيرفر وازعجه',
        'اصدر اي صوت يطلبه منك اللاعبين',
        'روح لاي سيرفر وخش روم وسوي نفسك تعرف الي بالروم',
        'روح لشخص غريب وقوله امر وتدلل وش بغيت',
        'اعترف بشيء محد يعرفه عنك',
        'تكلم بالفصحى لمدة 10 دقائق',
        'لا تتكلم ولا كلمة الين يجي دورك مرة ثانية واذا تكلمت يجيك باند لمدة يوم كامل من السيرفر',
        'خلي الي قبلك يختار لك افاتار بكيفه',

      ]
      const random = eiqab[Math.floor(Math.random() * eiqab.length)]
        let embed = new EmbedBuilder()
            .setAuthor({name : `${interaction.user.username}`, iconURL : `${interaction.user.displayAvatarURL({ dynamic : true })}`})
            .setThumbnail(`${interaction.guild.iconURL({ dynamic : true })}`)
             .setColor("Random")
            .setTitle(`${random}`)
            .setFooter({ text : `${client.user.username}`, iconURL : `${client.user.displayAvatarURL()}`})
        await interaction.reply({ embeds: [embed] });
    }
}